Revit 2025 API
TextAlignFlags Enumeration
An enumerated type listing all the Text align flags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TextAlignFlags
Public Enumeration TextAlignFlags
public enum class TextAlignFlags
type TextAlignFlags
Members
Member name | Value | Description
TEF_ALIGN_LEFT | 64 | Align text left
TEF_ALIGN_CENTER | 128 | Align text center
TEF_ALIGN_RIGHT | 256 | Align text right
TEF_ALIGN_TOP | 512 | Align text top
TEF_ALIGN_MIDDLE | 1,024 | Align text middle
TEF_ALIGN_BOTTOM | 2,048 | Align text bottom
See Also
Reference
Autodesk.Revit.DB Namespace